In [8]:
import numpy as np
import pandas as pd
import string

In [3]:
df = pd.read_csv('C:\\Users\\Ketan Gangal\\OneDrive\\Desktop\\python_basic\\Ml\\00 ml_course\\DATA\\tips.csv')

# Series Basics

In [10]:
ser = pd.Series(data = np.random.randint(1,200,26),index=[x for x in string.ascii_lowercase])

In [11]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [14]:
ser.head()

a     62
b    198
c     17
d    118
e    139
dtype: int32

In [17]:
s = pd.Series(data = {'Sammy':5,'Frank':10,'Spike':7}) # automatically assign keys as index

In [18]:
s

Sammy     5
Frank    10
Spike     7
dtype: int64

In [20]:
s['Sammy'] # call my key

5

In [22]:
s[0]# call by index

5

In [23]:
q1 = {'Japan': 80, 'China': 450, 'India': 200, 'USA': 250}
q2 = {'Brazil': 100, 'India': 210,'USA': 260,'China': 500}

In [24]:
data1 = pd.Series(data=q1)
data2 = pd.Series(data =q2)

In [28]:
data1

Japan     80
China    450
India    200
USA      250
dtype: int64

In [26]:
data2

Brazil    100
India     210
USA       260
China     500
dtype: int64

In [27]:
data1 + data2 # automatically finds missing and puts null in uncomman nan + data = nan

Brazil      NaN
China     950.0
India     410.0
Japan       NaN
USA       510.0
dtype: float64

In [29]:
data1.add(data2,fill_value = 0)  #automatically finds missing and puts 0 in uncomman 0+data = data

Brazil    100.0
China     950.0
India     410.0
Japan      80.0
USA       510.0
dtype: float64

In [35]:
data1.sub(data2,fill_value = 0)

Brazil   -100.0
China     -50.0
India     -10.0
Japan      80.0
USA       -10.0
dtype: float64

In [36]:
data1*2 # broadcasting

Japan    160
China    900
India    400
USA      500
dtype: int64

In [37]:
data1/2

Japan     40.0
China    225.0
India    100.0
USA      125.0
dtype: float64

In [38]:
data1.add_prefix('hello')

helloJapan     80
helloChina    450
helloIndia    200
helloUSA      250
dtype: int64

In [42]:
data1.aggregate(func=np.mean)

245.0

# DataFrames

In [44]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [45]:
df.describe() # all continous columns

       total_bill         tip        size  price_per_person     CC Number
count  244.000000  244.000000  244.000000        244.000000  2.440000e+02
mean    19.785943    2.998279    2.569672          7.888197  2.563496e+15
std      8.902412    1.383638    0.951100          2.914234  2.369340e+15
min      3.070000    1.000000    1.000000          2.880000  6.040679e+10
25%     13.347500    2.000000    2.000000          5.800000  3.040731e+13
50%     17.795000    2.900000    2.000000          7.255000  3.525318e+15
75%     24.127500    3.562500    3.000000          9.390000  4.553675e+15
max     50.810000   10.000000    6.000000         20.270000  6.596454e+15

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   total_bill        244 non-null    float64
 1   tip               244 non-null    float64
 2   sex               244 non-null    object
 3   smoker            244 non-null    object
 4   day               244 non-null    object
 5   time              244 non-null    object
 6   size              244 non-null    int64
 7   price_per_person  244 non-null    float64
 8   Payer Name        244 non-null    object
 9   CC Number         244 non-null    int64
 10  Payment ID        244 non-null    object
dtypes: float64(3), int64(2), object(6)
memory usage: 21.1+ KB

In [47]:
len(df)

244

In [55]:
df1 = pd.DataFrame(data=np.random.randint(2,200,(5,5)),index=['a','b','c','d','e'],columns=['a','b','c','d','e'])

In [57]:
df.index

RangeIndex(start=0, stop=244, step=1)

In [58]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size',
       'price_per_person', 'Payer Name', 'CC Number', 'Payment ID'],
      dtype='object')

# Selection and Indexing
* 1 Column
* 2 rows

In [61]:
df['tip'].head(3)

0    1.01
1    1.66
2    3.50
Name: tip, dtype: float64

In [64]:
df.loc[2] # all values of second row 'use if named index'

total_bill                     21.01
tip                              3.5
sex                             Male
smoker                            No
day                              Sun
time                          Dinner
size                               3
price_per_person                   7
Payer Name            Travis Walters
CC Number           6011812112971322
Payment ID                   Sun4458
Name: 2, dtype: object

In [65]:
df.iloc[2] # use if numeric index

total_bill                     21.01
tip                              3.5
sex                             Male
smoker                            No
day                              Sun
time                          Dinner
size                               3
price_per_person                   7
Payer Name            Travis Walters
CC Number           6011812112971322
Payment ID                   Sun4458
Name: 2, dtype: object

In [68]:
df = df.set_index('Payment ID')

In [69]:
df.head(2)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230

In [70]:
df.loc['Sun2959']

total_bill                       16.99
tip                               1.01
sex                             Female
smoker                              No
day                                Sun
time                            Dinner
size                                 2
price_per_person                  8.49
Payer Name          Christy Cunningham
CC Number             3560325168603410
Name: Sun2959, dtype: object

In [71]:
df.iloc[0]

total_bill                       16.99
tip                               1.01
sex                             Female
smoker                              No
day                                Sun
time                            Dinner
size                                 2
price_per_person                  8.49
Payer Name          Christy Cunningham
CC Number             3560325168603410
Name: Sun2959, dtype: object

In [76]:
df = df.reset_index()

In [78]:
df[['tip','CC Number']].head()

    tip         CC Number
0  1.01  3560325168603410
1  1.66  4478071379779230
2  3.50  6011812112971322
3  3.31  4676137647685994
4  3.61  4832732618637221

In [82]:
df.iloc[[0,1,2]][['tip','CC Number']]

    tip         CC Number
0  1.01  3560325168603410
1  1.66  4478071379779230
2  3.50  6011812112971322

In [85]:
df.drop([0,1],axis=0).head()

,Payment ID,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
2,Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322
3,Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994
4,Sun2251,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221
5,Sun9679,25.29,4.71,Male,No,Sun,Dinner,4,6.32,Erik Smith,213140353657882
6,Sun5985,8.77,2.00,Male,No,Sun,Dinner,2,4.38,Kristopher Johnson,2223727524230344

In [88]:
df.drop('Payment ID', axis=1).head(3)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322

# conditional Filtering

In [92]:
# 1 single condition
# 2 multiple condition

In [95]:
df[df['tip']>7]

,Payment ID,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
23,Sat239,39.42,7.58,Male,No,Sat,Dinner,4,9.86,Lance Peterson,3542584061609808
170,Sat1954,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236
212,Sat4590,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212

In [96]:
# and &
# or |
# not ~

In [105]:
df[(df['tip']>5) & (df['sex'] == 'Female') & (df['smoker']=='Yes')]

,Payment ID,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
214,Sat3374,28.17,6.5,Female,Yes,Sat,Dinner,3,9.39,Marissa Jackson,4922302538691962

In [106]:
options = ['Yes','Male','Sun',5]

In [114]:
df[df['sex'].isin(options) & df['smoker'].isin(options)].head()

,Payment ID,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
56,Sat8903,38.01,3.00,Male,Yes,Sat,Dinner,4,9.50,James Christensen DDS,349793629453226
58,Sat6683,11.24,1.76,Male,Yes,Sat,Dinner,2,5.62,Troy Guerrero,3560782621035582
60,Sat2353,20.29,3.21,Male,Yes,Sat,Dinner,2,10.14,Anthony Mclean,347614304015027
61,Sat3030,13.81,2.00,Male,Yes,Sat,Dinner,2,6.90,Ryan Hernandez,4766834726806
62,Sat2265,11.02,1.98,Male,Yes,Sat,Dinner,2,5.51,Joseph Hart,180046232326178

# Apply

In [115]:
def tips(x):
    return np.round(x)

In [117]:
df['tip'].apply(tips)

0      1.0
1      2.0
2      4.0
3      3.0
4      4.0
      ...
239    6.0
240    2.0
241    2.0
242    2.0
243    3.0
Name: tip, Length: 244, dtype: float64

In [118]:
df['tip'].apply(lambda x : np.round(x))

0      1.0
1      2.0
2      4.0
3      3.0
4      4.0
      ...
239    6.0
240    2.0
241    2.0
242    2.0
243    3.0
Name: tip, Length: 244, dtype: float64

In [122]:
def take(x,y):
    return x+y

In [124]:
df[['tip','total_bill']].apply(lambda df : take(df['tip'],df['total_bill']),axis=1)

0      18.00
1      12.00
2      24.51
3      26.99
4      28.20
       ...
239    34.95
240    29.18
241    24.67
242    19.57
243    21.78
Length: 244, dtype: float64

In [126]:
df['total']= np.vectorize(take)(df['tip'],df['total_bill'])

In [132]:
df.sort_values('tip',ascending=False).head(2)

,Payment ID,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,total
170,Sat1954,50.81,10.0,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,60.81
212,Sat4590,48.33,9.0,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,57.33

In [133]:
df.value_counts('time') # used for cateogires

time
Dinner    176
Lunch      68
dtype: int64

In [135]:
df.corr()

,total_bill,tip,size,price_per_person,CC Number,total
total_bill,1.000000,0.675734,0.598315,0.647554,0.104576,0.994668
tip,0.675734,1.000000,0.489299,0.347405,0.110857,0.748151
size,0.598315,0.489299,1.000000,-0.175359,-0.030239,0.607016
price_per_person,0.647554,0.347405,-0.175359,1.000000,0.135240,0.631486
CC Number,0.104576,0.110857,-0.030239,0.135240,1.000000,0.109641
total,0.994668,0.748151,0.607016,0.631486,0.109641,1.000000

In [145]:
df.max()

Payment ID                  Thur9862
total_bill                     50.81
tip                               10
sex                             Male
smoker                           Yes
day                             Thur
time                           Lunch
size                               6
price_per_person               20.27
Payer Name              William Roth
CC Number           6596453823950595
total                          60.81
dtype: object

In [138]:
df.min()

Payment ID                 Fri144
total_bill                   3.07
tip                             1
sex                        Female
smoker                         No
day                           Fri
time                       Dinner
size                            1
price_per_person             2.88
Payer Name          Aaron Bentley
CC Number             60406789937
total                        4.07
dtype: object

In [142]:
df['total'].idxmax()

170

In [143]:
df.iloc[170]

Payment ID                   Sat1954
total_bill                     50.81
tip                               10
sex                             Male
smoker                           Yes
day                              Sat
time                          Dinner
size                               3
price_per_person               16.94
Payer Name             Gregory Clark
CC Number           5473850968388236
total                          60.81
Name: 170, dtype: object

In [146]:
df['sex'].replace(['Female','Male'],['F','M'])

0      F
1      M
2      M
3      M
4      F
      ..
239    M
240    F
241    M
242    M
243    F
Name: sex, Length: 244, dtype: object

In [148]:
d = {'Female':'F' , 'Male' : 'M'}
df['sex'].map(d)

0      F
1      M
2      M
3      M
4      F
      ..
239    M
240    F
241    M
242    M
243    F
Name: sex, Length: 244, dtype: object

In [149]:
df['time'].unique()

array(['Dinner', 'Lunch'], dtype=object)

In [150]:
df['time'].nunique()

2

In [154]:
df.nlargest(5,columns=['tip','price_per_person'],keep = 'all')

,Payment ID,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,total
170,Sat1954,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,60.81
212,Sat4590,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,57.33
23,Sat239,39.42,7.58,Male,No,Sat,Dinner,4,9.86,Lance Peterson,3542584061609808,47.00
59,Sat8139,48.27,6.73,Male,No,Sat,Dinner,4,12.07,Brian Ortiz,6596453823950595,55.00
141,Thur1025,34.30,6.70,Male,No,Thur,Lunch,6,5.72,Steven Carlson,3526515703718508,41.00

In [161]:
df['tip'].between(2,3,inclusive = True)

,Payment ID,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,total
6,Sun5985,8.77,2.00,Male,No,Sun,Dinner,2,4.38,Kristopher Johnson,2223727524230344,10.77
13,Sun2971,18.43,3.00,Male,No,Sun,Dinner,4,4.61,Joshua Jones,6011163105616890,21.43
21,Sat9618,20.29,2.75,Female,No,Sat,Dinner,2,10.14,Natalie Gardner,5448125351489749,23.04
22,Sat9786,15.77,2.23,Female,No,Sat,Dinner,2,7.88,Ashley Shelton,3524119516293213,18.00
25,Sat907,17.81,2.34,Male,No,Sat,Dinner,4,4.45,Robert Perkins,30502930499388,20.15
...,...,...,...,...,...,...,...,...,...,...,...,...
231,Sat6334,15.69,3.00,Male,Yes,Sat,Dinner,3,5.23,Jason Parks,4812333796161,18.69
234,Sat7220,15.53,3.00,Male,Yes,Sat,Dinner,2,7.76,Tracy Douglas,4097938155941930,18.53
240,Sat1766,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,29.18
241,Sat3880,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,24.67
243,Thur672,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,21.78

In [162]:
simple_df = pd.DataFrame([1,2,2],['a','b','c'])

In [163]:
simple_df

   0
a  1
b  2
c  2

In [164]:
simple_df.duplicated()

a    False
b    False
c     True
dtype: bool

In [165]:
simple_df.drop_duplicates()

   0
a  1
b  2

# Missing Values
* Keep null
* drop null
* replace null

In [167]:
df = pd.read_csv('C:\\Users\\Ketan Gangal\\OneDrive\\Desktop\\python_basic\\Ml\\00 ml_course\\DATA\\movie_scores.csv')

In [171]:
df.isnull() # Similar to df.isna()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0       False      False  False  False            False             False
1        True       True   True   True             True              True
2       False      False  False  False             True              True
3       False      False  False  False            False             False
4       False      False  False  False            False             False

In [173]:
df.notna() # similar to df.notnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0        True       True   True   True             True              True
1       False      False  False  False            False             False
2        True       True   True   True            False             False
3        True       True   True   True             True              True
4        True       True   True   True             True              True

In [178]:
df[df['first_name'].notna()]

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [179]:
df.dropna() # drop all null

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [195]:
df.dropna(how = 'all')

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [196]:
df.dropna(how='any')

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [197]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [199]:
df.fillna(value = 'x',axis = 1)

  first_name last_name age sex pre_movie_score post_movie_score
0        Tom     Hanks  63   m               8               10
1          x         x   x   x               x                x
2       Hugh   Jackman  51   m               x                x
3      Oprah   Winfrey  66   f               6                8
4       Emma     Stone  31   f               7                9

In [202]:
df['first_name'].fillna('name',inplace=True)

In [203]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1       name       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [204]:
df['pre_movie_score'].interpolate()

0    8.000000
1    7.333333
2    6.666667
3    6.000000
4    7.000000
Name: pre_movie_score, dtype: float64